I was not able to reproduce this with this code. I also tried with the latest v6 Terraform plugin for Google Cloud.

```hcl
variable "project_id" {
  description = "Toolkit deployment variable: project_id"
  type        = string
}

variable "region" {
  description = "Toolkit deployment variable: region"
  type        = string
}

variable "zone" {
  description = "Toolkit deployment variable: zone"
  type        = string
}

variable "address" {
  description = "The IP address or beginning of the address range allocated for the private service access."
  type        = string
  default     = null
}

variable "network_id" {
  description = <<-EOT
    The ID of the GCE VPC network to configure private service Access.:
    `projects/<project_id>/global/networks/<network_name>`"
    EOT
  type        = string
  validation {
    condition     = length(split("/", var.network_id)) == 5
    error_message = "The network id must be provided in the following format: projects/<project_id>/global/networks/<network_name>."
  }
}

variable "prefix_length" {
  description = "The prefix length of the IP range allocated for the private service access."
  type        = number
  default     = 16
}

terraform {
  required_version = ">= 1.2"

  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "~> 5.38.0"
    }
    google-beta = {
      source  = "hashicorp/google-beta"
      version = "~> 5.38.0"
    }
  }
}

provider "google" {
  project = var.project_id
  region  = var.region
  zone    = var.zone
}

provider "google-beta" {
  project = var.project_id
  region  = var.region
  zone    = var.zone
}

resource "random_id" "resource_name_suffix" {
  byte_length = 4
}

resource "google_compute_global_address" "private_ip_alloc" {
  provider      = google-beta
  name          = "global-psconnect-ip-${random_id.resource_name_suffix.hex}"
  purpose       = "VPC_PEERING"
  address_type  = "INTERNAL"
  network       = var.network_id
  prefix_length = var.prefix_length
  labels        = {}
  address       = var.address
}
```

and these variables:

```tfvars
region = "us-central1"
zone = "us-central1-a"
project_id = "my-project"
network_id = "projects/my-project/global/networks/default"
```

`terraform plan` works as I'd expect:

```
  # google_compute_global_address.private_ip_alloc will be created
  + resource "google_compute_global_address" "private_ip_alloc" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = (known after apply)
      + network            = "projects/toolkit-demo-zero-e913/global/networks/default"
      + prefix_length      = 16
      + project            = "my-project"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }
```